InformationRegisters/РассылкаСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РассылкаСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолучательАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучательПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вложения</Name>
					<Comment>Массив вложений письма</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщенияIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРассылки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПостановкиВОчередь</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РассылкаСообщений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РассылкиСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтчетныйПериодСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОтправкиСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыОтправкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыОтправкиСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыРассылки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РассылкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РассылкиСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРассылокСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассылки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующаяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РассылкаСообщений/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОтправитьСообщения", Истина);
	Методы.Вставить("ЗаписатьОчередьИОтправитьСообщенияВФоне", Истина);
	
КонецПроцедуры

// Метод регламентного задания РассылкаСообщений
//
Процедура ОтправитьСообщения() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	ПараметрыОтправки = НовыйПараметрыОтправкиСообщений();
	ВыполнитьОтравкуСообщений(ПараметрыОтправки);
	
КонецПроцедуры

// Записывает очередь рассылки и отправляет сообщения в фоне.
//
// Параметры:
//  ПараметрыРассылки - Структура - см. НовыйПараметрыРассылки() - параметры рассылки.
//  СпециальныеПараметрыРассылки - Структура - параметры, специфичные для конкретного вида рассылки.
// Возвращаемое значение:
//  Структура - см. ДлительныеОперации.ВыполнитьФункцию().
//
Функция ЗапуститьФоновоеЗаданиеЗаписатьОчередьИОтправитьСообщения(ПараметрыРассылки, СпециальныеПараметрыРассылки) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Запись очереди рассылки и отправка сообщений'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ПараметрыРассылки", ПараметрыРассылки);
	ПараметрыЗадания.Вставить("СпециальныеПараметрыРассылки", СпециальныеПараметрыРассылки);
	ПараметрыЗадания.Вставить("ПараметрыОтправки", НовыйПараметрыОтправкиСообщений());
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"РассылкаСообщений.ЗаписатьОчередьИОтправитьСообщенияВФоне",
		ПараметрыЗадания);
	
КонецФункции

// Регистрирует очередь и отправляет сообщения в фоне.
// 
// Параметры:
//  ПараметрыЗадания - Структура - См. ЗапуститьФоновоеЗаданиеЗаписатьОчередьИОтправитьСообщения()
// 
// Возвращаемое значение:
//  СправочникСсылка.РассылкиСообщений, Неопределено - созданная рассылка или Неопределено, если очередь не была создана
//
Функция ЗаписатьОчередьИОтправитьСообщенияВФоне(ПараметрыЗадания) Экспорт
	
	Прогресс = Новый Структура;
	Прогресс.Вставить("Состояние", "НачатаЗаписьОчереди");
	Прогресс.Вставить("РассылкаСообщений");
	
	Баннер = РегистрыСведений.РассылкаСообщений.НовыйДанныеБаннера();
	Баннер.ТекстБаннера = Нстр("ru = 'Запись очереди рассылки'");
	
	Прогресс.Вставить("Баннер", Баннер);
	
	ДлительныеОперации.СообщитьПрогресс(0,, Прогресс);
	
	НачатьТранзакцию();
	
	Попытка
		
		Рассылка = РегистрыСведений.РассылкаСообщений.ЗарегистрироватьОчередьРассылкиСообщений(
			ПараметрыЗадания.ПараметрыРассылки, ПараметрыЗадания.СпециальныеПараметрыРассылки);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			);
		
		Прогресс.Состояние = "ОшибкаЗаписиОчереди";
		Прогресс.Баннер.ТекстБаннера = Нстр("ru = 'Ошибка при записи очереди рассылки. См. журнал регистрации.'");
		ДлительныеОперации.СообщитьПрогресс(0,, Прогресс);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
	Прогресс.Состояние = "НачатаРассылкаСообщений";
	Прогресс.РассылкаСообщений = Рассылка;
	Прогресс.Баннер.ТекстБаннера = Нстр("ru = 'Рассылка сообщений'");
	ДлительныеОперации.СообщитьПрогресс(0,, Прогресс); // Процент выполнения не используется, поэтому 0
	
	Попытка
		ВыполнитьОтравкуСообщений(ПараметрыЗадания.ПараметрыОтправки);
	Исключение
		ВозобновитьЗаданиеОтправки(10);
	КонецПопытки;
	
	Возврат Рассылка;
	
КонецФункции

// Отключает задание рассылки сообщений, когда в очереди отсутсвуют данные для отправки.
//
Процедура ОтключитьНевостребованноеЗадание() Экспорт
	
	Если РегистрыСведений.РассылкаСообщений.ОтсутствуютДанныеДляОтправки() Тогда
		ОтключитьЗадание();
	КонецЕсли;
	
КонецПроцедуры

// По записям незавершенных рассылок с состоянием "В очереди на отправку" устанавливает состояние "Отменено"
//
// Параметры:
//  НезавершенныеРассылки - Массив из СправочникСсылка.РассылкиСообщений- список незавершенных рассылок, по которым происходит отправка
//
Процедура ОтменитьРассылку(НезавершенныеРассылки) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.РассылкаСообщений");
		ТаблицаРассылок = Новый ТаблицаЗначений;
		ТаблицаРассылок.Колонки.Добавить("РассылкаСообщений", Новый ОписаниеТипов("СправочникСсылка.РассылкиСообщений"));
		Для Каждого Рассылка Из НезавершенныеРассылки Цикл
			ТаблицаРассылок.Добавить().РассылкаСообщений = Рассылка;
		КонецЦикла;
		ЭлементБлокировки.ИсточникДанных = ТаблицаРассылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("РассылкаСообщений", "РассылкаСообщений");
		Блокировка.Заблокировать();
		
		ОтключитьЗадание();
		
		РегистрыСведений.РассылкаСообщений.ЗарегистрироватьОтменуОтправки(НезавершенныеРассылки);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Конструктор параметров рассылки
// 
// Возвращаемое значение:
//  Структура - Пустая коллекция параметров. Свойства:
// * Получатели - ТаблицаЗначений, Неопределено - получатели рассылки
// * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - учетная запись, с которой выполняется рассылка
// * ВидРассылки - ПеречислениеСсылка.ВидыРассылокСообщений - вид сообщений
// * РассылкаСообщений - СправочникСсылка.РассылкиСообщений - элемент справочника рассылок
//
Функция НовыйПараметрыРассылки() Экспорт
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("Получатели",    Неопределено);
	ПараметрыРассылки.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка());
	ПараметрыРассылки.Вставить("ВидРассылки", Перечисления.ВидыРассылокСообщений.ПустаяСсылка());
	ПараметрыРассылки.Вставить("РассылкаСообщений", Справочники.РассылкиСообщений.ПустаяСсылка());
	
	Возврат ПараметрыРассылки;
	
КонецФункции

// Конструктор параметров отправки электронных писем
//
// Возвращаемое значение:
//  Структура - параметры отправки электронных писем. Свойства:
//   * ВыполнятьРассылку - Булево - позволяет остановить отправку, например при достижении ограничения
//   * ПерваяПорция - Булево - флаг снимается после обработки первой порции
//   * СчетчикСессии - Число - счетчик отправленных писем в сессии
// Также содержит свойства из Справочники.РассылкиСообщений.НовыйПараметрыОтправкиПисем().
//
Функция НовыйПараметрыОтправкиСообщений() Экспорт
	
	ПараметрыОтправки = Новый Структура;
	
	ПараметрыОтправки.Вставить("ВыполнятьРассылку", Истина);
	ПараметрыОтправки.Вставить("ПерваяПорция",      Истина);
	ПараметрыОтправки.Вставить("СчетчикСессии",     0);
	
	// Настройки отправки писем - далее могут быть переопределены из элемента справочника рассылок
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
		ПараметрыОтправки, Справочники.РассылкиСообщений.НовыйПараметрыОтправкиПисем());

	РассылкаСообщенийПереопределяемый.ПриИнициализацииПараметровОтправкиСообщений(ПараметрыОтправки);

	Возврат ПараметрыОтправки;

КонецФункции

// Конструктор параметров электронного письма - формирует минимальный набор параметров.
// Состав свойств может быть расширен для конретного вида отправки, но должен соотвествовать
// описанию метода РаботаСПочтовымиСообщениями.ПодготовитьПисьмо().
//
// Параметры:
//  ВидРассылки - ПеречислениеСсылка.ВидыРассылокСообщений - вид рассылки.
//
// Возвращаемое значение:
//   Структура   - параметры электронного письма. Свойства:
//   * Кому - Массив из Строка, Структура - массив получателей с адресами.
//   * Тема - Строка - тема электронного письма.
//   * Тело - Строка - текст электронного письма (по умолчанию HTML-текст).
//   * ТипТекста - Строка, ТипТекстаПочтовогоСообщения, ПеречислениеСсылка.ТипыТекстовЭлектронныхПисем -
//                 тип текста электронного письма (по умолчанию HTML).
//   * Вложения - Массив из Структура- массив вложений электронного письма.
//
Функция НовыйПараметрыПочтовогоСообщения(ВидРассылки) Экспорт
	
	ПараметрыЭлектронногоПисьма = Новый Структура;
	
	ПараметрыЭлектронногоПисьма.Вставить("Кому", Новый Массив);
	ПараметрыЭлектронногоПисьма.Вставить("Тема", "");
	ПараметрыЭлектронногоПисьма.Вставить("Тело", "");
	ПараметрыЭлектронногоПисьма.Вставить("ТипТекста", "HTML");
	ПараметрыЭлектронногоПисьма.Вставить("Вложения", Новый Массив);

	РассылкаСообщенийПереопределяемый.ПриИнициализацииПараметровПочтовогоСообщения(
		ПараметрыЭлектронногоПисьма, ВидРассылки);

	Возврат ПараметрыЭлектронногоПисьма;
	
КонецФункции

// Возвращает имя события журнала регистрации.
//
// Возвращаемое значение:
//  Строка - имя события журнала регистрации.
//
Функция ИмяСобытияЖурналаРегистрации() Экспорт
	
	Возврат НСтр("ru = 'Рассылка сообщений'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

// Подключает регламентное задание к механизму очереди заданий БТС.
// См. комментарий к модулю ОчередьЗаданий:
//    Могут использоваться только методы для которых зарегистрированы псевдонимы через
//    процедуру ПриОпределенииПсевдонимовОбработчиков общего модуля ОчередьЗаданийПереопределяемый.
//
// Параметры:
//  МетодыРегламентныхЗаданий - Соответствие из Строка - ключ - имя метода регламентного задания
//
Процедура ДополнитьПсевдонимыОбработчиковОчередиЗаданий(МетодыРегламентныхЗаданий) Экспорт
	
	МетодыРегламентныхЗаданий.Вставить(Метаданные.РегламентныеЗадания.РассылкаСообщений.ИмяМетода);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьОтравкуСообщений(ПараметрыОтправки)
	
	ВыполнитьОтравкуСообщенийПоЭлектроннойПочте(ПараметрыОтправки);
	
	Справочники.РассылкиСообщений.ЗавершитьОтправленныеРассылки();
	
	ОтключитьНевостребованноеЗадание();
	
КонецПроцедуры

// Переносит задание отправки сообщений на количество секунд.
//
// Параметры:
//  КоличествоСекунд - Число - Количество секунд, через которое нужно запустить задание.
//
Процедура ВозобновитьЗаданиеОтправки(КоличествоСекунд)
	
	Если Не РегистрыСведений.РассылкаСообщений.ОтсутствуютДанныеДляОтправки() Тогда
		СледующаяПопытка = ТекущаяДатаСеанса() + КоличествоСекунд;
		ДобавитьЗаданиеНаОтправкуВОчередь(СледующаяПопытка);
	КонецЕсли;
	
КонецПроцедуры

// Переносит отправку сообщений на более поздний срок, если не удается отправить ни одного письма
//
// Параметры:
//  НезавершеннаяРассылка - СправочникСсылка.РассылкиСообщений - рассылка, по которой происходит отправка
//  СообщенийВПопытке - Число - количество сообщений, отправленных в текущей попытке отправки
//
Процедура ПеренестиОтправку(НезавершеннаяРассылка, СообщенийВПопытке = 0)
	
	НачатьТранзакцию();
	
	Попытка
		
		ВыполненоПопытокОтправки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НезавершеннаяРассылка, "ВыполненоПопытокОтправки");
		Час = 3600;
		// Если попытка отправки уже не первая, и ни одного сообщения не было отправлено, то переносим на следующий день.
		// Причем для файлового варианта предусмотрим ограничение по времени - не ранее 8:00 следующего дня. Это связано с тем,
		// что ожидаем, что в файловой базе не будет сеансов в течение ночи.
		// Если попытка была первая или что-то было отправлено, то переносим на час.
		Если ВыполненоПопытокОтправки > 0 И СообщенийВПопытке = 0 Тогда
			Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
				СледующаяПопытка = КонецДня(ТекущаяДатаСеанса()) + 1 + (8 * Час); // завтра 8:00
			Иначе
				СледующаяПопытка = Макс(ТекущаяДатаСеанса() + Час, КонецДня(ТекущаяДатаСеанса()) + 1); // завтра 00:00, но не ранее, чем через час
			КонецЕсли;
		Иначе
			СледующаяПопытка = ТекущаяДатаСеанса() + Час;
		КонецЕсли;
		
		ЗарегистрироватьПопыткуЗапускаРассылки(НезавершеннаяРассылка, СледующаяПопытка);
		
		ДобавитьЗаданиеНаОтправкуВОчередь(СледующаяПопытка);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьЗаданиеНаОтправкуВОчередь(МоментЗапуска)
	
	МетаданныеРегламентногоЗадания = Метаданные.РегламентныеЗадания.РассылкаСообщений;
	
	ПараметрыПоискаЗадания = Новый Структура;
	ПараметрыПоискаЗадания.Вставить("Метаданные", МетаданныеРегламентногоЗадания);
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ДатаНачала = МоментЗапуска;
	Расписание.ВремяНачала = МоментЗапуска;
	// Пытаемся запустить задание раз в час, начиная с указанного момента.
	// При успешном запуске задание будет либо перепланировано, либо отключено.
	Расписание.ПериодПовтораДней = 1;
	Расписание.ПериодПовтораВТечениеДня = 3600;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Расписание",    Расписание);
	ПараметрыЗадания.Вставить("Использование", Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыПоискаЗадания);
	Если ЗначениеЗаполнено(Задания) Тогда
		РегламентныеЗаданияСервер.ИзменитьЗадание(Задания[0], ПараметрыЗадания);
	Иначе
		ПараметрыЗадания.Вставить("Метаданные", МетаданныеРегламентногоЗадания);
		РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Устанавливает реквизиты рассылки при неудачном завершении текущей попытки отправки сообщений
//
// Параметры:
//  НезавершеннаяРассылка - СправочникСсылка.РассылкиСообщений - незавершенная рассылка, по которой происходит отправка
//  СледующаяПопытка - Дата
//
Процедура ЗарегистрироватьПопыткуЗапускаРассылки(НезавершеннаяРассылка, СледующаяПопытка)
	
	РассылкаОбъект = НезавершеннаяРассылка.ПолучитьОбъект();
	РассылкаОбъект.СледующаяПопытка = СледующаяПопытка;
	РассылкаОбъект.ВыполненоПопытокОтправки = РассылкаОбъект.ВыполненоПопытокОтправки + 1;
	
	РассылкаОбъект.Записать();
	
КонецПроцедуры

Процедура ОтключитьЗадание()
	
	МетаданныеРегламентногоЗадания = Метаданные.РегламентныеЗадания.РассылкаСообщений;
	
	ПараметрыПоискаЗадания = Новый Структура;
	ПараметрыПоискаЗадания.Вставить("Метаданные",    МетаданныеРегламентногоЗадания);
	ПараметрыПоискаЗадания.Вставить("Использование", Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыПоискаЗадания);
	Для Каждого Задание Из Задания Цикл
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Использование", Ложь);
		РегламентныеЗаданияСервер.ИзменитьЗадание(Задание.УникальныйИдентификатор, ПараметрыЗадания);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#Область РассылкаПоЭлектроннойПочте

Процедура ВыполнитьОтравкуСообщенийПоЭлектроннойПочте(ПараметрыОтправки)
	
	СпособыОтправкиЭлектроннаяПочта = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Перечисления.СпособыОтправкиСообщений.ЭлектроннаяПочта);
	
	Пока ПараметрыОтправки.ВыполнятьРассылку Цикл
		
		НезавершенныеРассылки = РегистрыСведений.РассылкаСообщений.НезавершенныеРассылкиДляОтправки(
			СпособыОтправкиЭлектроннаяПочта, ПараметрыОтправки);
		
		Если Не ЗначениеЗаполнено(НезавершенныеРассылки) Тогда
			Прервать;
		КонецЕсли;
		
		ВсеРассылкиЗаблокированы = Истина;
		ОтправленоСообщений = 0;
		
		Для Каждого НезавершеннаяРассылка Из НезавершенныеРассылки Цикл
			
			Если Не Справочники.РассылкиСообщений.ЗаблокироватьРассылкуДляОтправки(НезавершеннаяРассылка) Тогда
				Продолжить;
			КонецЕсли;
			
			ВсеРассылкиЗаблокированы = Ложь;
			
			ВидРассылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НезавершеннаяРассылка, "ВидРассылки");
			РассылкаСообщенийПереопределяемый.ПередОтправкойПочтовыхСообщенийПоРассылке(НезавершеннаяРассылка, ВидРассылки, ПараметрыОтправки);
			
			//@skip-check query-in-loop
			ВыполнитьОтправкуПочтовыхСообщенийПоРассылке(НезавершеннаяРассылка, ПараметрыОтправки, ОтправленоСообщений);
			
			Справочники.РассылкиСообщений.РазблокироватьРассылкуДляОтправки(НезавершеннаяРассылка);
			
			РассылкаСообщенийПереопределяемый.ПослеОтправкиПочтовыхСообщенийПоРассылке(НезавершеннаяРассылка, ПараметрыОтправки);
			
			Если Не ПараметрыОтправки.ВыполнятьРассылку Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВсеРассылкиЗаблокированы Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьОтправкуПочтовыхСообщенийПоРассылке(НезавершеннаяРассылка, ПараметрыОтправки, ОтправленоСообщений)
	
	ДозироватьОтправку = ПараметрыОтправки.ДозироватьОтправкуПисем;
	ПаузаМеждуПорциями = ПараметрыОтправки.ПаузаМеждуПорциямиПисем;
	ПисемВСессии =       ПараметрыОтправки.ПисемВСессии;
	ПаузаМеждуСессиями = ПараметрыОтправки.ПаузаМеждуСессиямиОтправкиПисем;

	Пока Истина Цикл
		
		ПорцияСообщений = ПодготовитьПорциюПочтовыхСообщений(НезавершеннаяРассылка, ПараметрыОтправки);
		
		Если Не ЗначениеЗаполнено(ПорцияСообщений) Тогда
			Возврат;
		КонецЕсли;
		
		Если ДозироватьОтправку И ПаузаМеждуПорциями > 0 И Не ПараметрыОтправки.ПерваяПорция Тогда
			// Пауза между порциями
			ОбщегоНазначенияБТС.Пауза(ПаузаМеждуПорциями);
		КонецЕсли;
		
		ОтправленоПисем = ОтправитьПорциюПочтовыхСообщений(НезавершеннаяРассылка, ПорцияСообщений, ПараметрыОтправки);
		ОтправленоСообщений = ОтправленоСообщений + ОтправленоПисем;
		ПараметрыОтправки.СчетчикСессии = ПараметрыОтправки.СчетчикСессии + ОтправленоПисем;
		Если ОтправленоПисем = 0 Тогда
			// Не отправилось ни одно письмо - скорее всего мы достигли лимита сообщений.
			// Переносим отправку на более поздний срок: первый перенос на 1 час, а потом на следующий день.
			ПеренестиОтправку(НезавершеннаяРассылка, ОтправленоСообщений);
			ПараметрыОтправки.ВыполнятьРассылку = Ложь;
			Возврат;
		КонецЕсли;
		
		ПараметрыОтправки.ПерваяПорция = Ложь;
		
		Если ДозироватьОтправку И ПисемВСессии > 0 И ПаузаМеждуСессиями > 0 И ПараметрыОтправки.СчетчикСессии >= ПисемВСессии Тогда
			// После каждой сессии нужен перерыв
			ВозобновитьЗаданиеОтправки(ПаузаМеждуСессиями);
			ПараметрыОтправки.ВыполнятьРассылку = Ложь;
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьПорциюПочтовыхСообщений(НезавершеннаяРассылка, ПараметрыОтправки)
	
	ДозироватьОтправку = ПараметрыОтправки.ДозироватьОтправкуПисем;
	ПисемВПорции = ПараметрыОтправки.ПисемВПорции;
	ПредельноеКоличествоПопытокОтправкиПисьма = ПараметрыОтправки.КоличествоПопытокОтправкиПисьма;

	Запрос = Новый Запрос;
	
	Запрос.Параметры.Вставить("ПредельноеКоличествоПопытокОтправкиПисьма", ПредельноеКоличествоПопытокОтправкиПисьма);
	Запрос.УстановитьПараметр("НезавершеннаяРассылка", НезавершеннаяРассылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СпособыОтправки",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.СпособыОтправкиСообщений.ЭлектроннаяПочта));
	
	// Текст запроса может быть изменен ниже через СхемаЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*,
	|	СостоянияРассылкиСообщений.РассылкаСообщений.УчетнаяЗапись КАК УчетнаяЗапись
	|ИЗ
	|	РегистрСведений.РассылкаСообщений КАК СостоянияРассылкиСообщений
	|ГДЕ
	|	СостоянияРассылкиСообщений.РассылкаСообщений = &НезавершеннаяРассылка
	|	И СостоянияРассылкиСообщений.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыРассылки.Ожидание)
	|	И СостоянияРассылкиСообщений.РассылкаСообщений.СледующаяПопытка <= &ТекущаяДата
	|	И СостоянияРассылкиСообщений.ВыполненоПопытокОтправки <= &ПредельноеКоличествоПопытокОтправкиПисьма
	|	И СостоянияРассылкиСообщений.СпособОтправки В (&СпособыОтправки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПостановкиВОчередь,
	|	Получатель";
	
	Если ДозироватьОтправку И ПисемВПорции > 0 Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].КоличествоПолучаемыхЗаписей = ПисемВПорции;
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;

	ПорцияСообщений = Запрос.Выполнить().Выгрузить();
	РассылкаСообщенийПереопределяемый.ПослеВыборкиПорцииПочтовыхСообщений(ПорцияСообщений);
	
	Возврат ПорцияСообщений;
	
КонецФункции

Функция ОтправитьПорциюПочтовыхСообщений(Рассылка, ПорцияСообщений, ПараметрыОтправки)
	
	ОтправленоПисем = 0;
	ВидРассылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Рассылка, "ВидРассылки");
	
	Для Каждого СтрокаРассылки Из ПорцияСообщений Цикл
		
		ОписаниеОшибки = "";
		ОшибочныеПолучатели = Неопределено;
		
		ПараметрыПисьма = ПараметрыПочтовогоСообщения(СтрокаРассылки, ВидРассылки);

		НачатьТранзакцию();

		Попытка
			
			Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(СтрокаРассылки.УчетнаяЗапись, ПараметрыПисьма);
			РезультатОтправки = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(СтрокаРассылки.УчетнаяЗапись, Письмо);
			СтрокаРассылки.ИдентификаторСообщения = ?(ЗначениеЗаполнено(РезультатОтправки.ИдентификаторПисьмаSMTP),
				РезультатОтправки.ИдентификаторПисьмаSMTP, РезультатОтправки.ИдентификаторПисьмаIMAP);
			СтрокаРассылки.ИдентификаторСообщенияIMAP = РезультатОтправки.ИдентификаторПисьмаIMAP;
				
			ОшибочныеПолучатели = РезультатОтправки.ОшибочныеПолучатели;

			ЗафиксироватьТранзакцию();

		Исключение

			ОтменитьТранзакцию();

			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(
				ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
		КонецПопытки;
		
		Если ЗначениеЗаполнено(СтрокаРассылки.ИдентификаторСообщения) Тогда
			РегистрыСведений.РассылкаСообщений.ЗарегистрироватьУспешнуюОтправку(СтрокаРассылки, ПараметрыОтправки);
			ОтправленоПисем = ОтправленоПисем + 1;
		ИначеЕсли ЗначениеЗаполнено(ОшибочныеПолучатели) Тогда
			ЗарегистрироватьОшибкуОтправкиОшибочнымПолучателям(СтрокаРассылки, ОшибочныеПолучатели, ПараметрыОтправки);
		Иначе
			РегистрыСведений.РассылкаСообщений.ЗарегистрироватьОшибкуПриОтправкеИПоставитьВКонецОчереди(
				СтрокаРассылки, ОписаниеОшибки, ПараметрыОтправки);
		КонецЕсли;
		
		Для Каждого СтрокаВложения Из ПараметрыПисьма.Вложения Цикл
			УдалитьИзВременногоХранилища(СтрокаВложения.АдресВоВременномХранилище);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ОтправленоПисем;
	
КонецФункции

Функция ПараметрыПочтовогоСообщения(СтрокаРассылки, ВидРассылки)
	
	ПараметрыПисьма = НовыйПараметрыПочтовогоСообщения(ВидРассылки);
	
	ПараметрыПисьма.Кому = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый Структура("Адрес, Представление", СтрокаРассылки.ПолучательАдрес, СтрокаРассылки.ПолучательПредставление));

	ПараметрыПисьма.Тема = СтрокаРассылки.Тема;
	ПараметрыПисьма.Тело = СтрокаРассылки.Текст;
	
	ВложенияВДвоичныхДанных = СтрокаРассылки.Вложения.Получить();
	
	Вложения = Новый Массив;
	
	Для Каждого ОписаниеВложения Из ВложенияВДвоичныхДанных Цикл
		
		ЭтоКартинкаИзТелаПисьма = ОписаниеВложения.Свойство("Идентификатор");
		НовоеВложение = НовыйОписаниеВложенияПочтовогоСообщения(ЭтоКартинкаИзТелаПисьма);
		
		НовоеВложение.Представление = ОписаниеВложения.Представление;
		НовоеВложение.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(
			ОписаниеВложения.ДвоичныеДанные);
			
		Если ЭтоКартинкаИзТелаПисьма Тогда
			НовоеВложение.Идентификатор = ОписаниеВложения.Идентификатор;
		КонецЕсли;
			
		Вложения.Добавить(НовоеВложение);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Вложения) Тогда
		ПараметрыПисьма.Вложения = Вложения;
	КонецЕсли;
	
	Возврат ПараметрыПисьма;
	
КонецФункции

Функция НовыйОписаниеВложенияПочтовогоСообщения(КартинкаИзТелаПисьма = Ложь) Экспорт
	
	ОписаниеВложения = Новый Структура;
	
	ОписаниеВложения.Вставить("Представление", "");
	ОписаниеВложения.Вставить("АдресВоВременномХранилище", "");
	Если КартинкаИзТелаПисьма Тогда
		ОписаниеВложения.Вставить("Идентификатор", "");
	КонецЕсли;
	
	Возврат ОписаниеВложения;
	
КонецФункции

Процедура ЗарегистрироватьОшибкуОтправкиОшибочнымПолучателям(СтрокаРассылки, ОшибочныеПолучатели, ПараметрыОтправки)
	
	ОшибкиЛога = Новый Массив;
	Для Каждого ОшибочныйПолучатель Из ОшибочныеПолучатели Цикл
		ОшибкиЛога.Добавить(ОшибочныйПолучатель.Значение);
	КонецЦикла;
	
	ТекстОшибкиЛога = СтрШаблон(НСтр("ru = 'Ошибочный получатель:
		| %1'"), СтрСоединить(ОшибкиЛога, Символы.ПС));
	
	РегистрыСведений.РассылкаСообщений.ЗарегистрироватьОшибкуПриОтправке(СтрокаРассылки, ТекстОшибкиЛога, ПараметрыОтправки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
